PYTHON EXERCISES:

In [3]:
import pandas as pd;

1. Load a CSV file into a pandas DataFrame.

In [ ]:
location_df = pd.read_csv('../csv_files/locations.csv')

2. Check the first 5 rows of the DataFrame.

In [ ]:
print(location_df.head(5))

3. Get the shape of the DataFrame (rows, columns).

In [6]:
print(location_df.shape)

(10, 2)

4. Get summary statistics (mean, median, mode, std) of numerical columns.

In [11]:
employees_df = pd.read_csv('../csv_files/employees.csv')

In [ ]:
print('4.1 Mean of numeric columns')
print('-----------------------')
print(employees_df.mean(numeric_only=True))

Mean of Numeric Columns
-----------------------
EmployeeID        5.5
Salary        48950.0
dtype: float64

In [ ]:
print('4.2 Mode of numeric columns')
print('-----------------------')
mode_value = employees_df.mode(numeric_only=True)
print(mode_value)

Mode of numeric columns
-----------------------
   EmployeeID  Salary
0           1     500
1           2    3000
2           3   46000
3           4   49000
4           5   52000
5           6   55000
6           7   60000
7           8   67000
8           9   75000
9          10   82000

In [ ]:
print('4.3 Median of numeric columns')
print('-----------------------')
print(employees_df.median(numeric_only=True))

Median of numeric columns
-----------------------
EmployeeID        5.5
Salary        53500.0
dtype: float64

In [ ]:
print('4.4 Std of numeric columns')
print('-----------------------')
print(employees_df.std(numeric_only=True))

Std of numeric columns
-----------------------
EmployeeID        3.027650
Salary        27350.045704
dtype: float64

5. Get the data types of each column.

In [30]:
print(employees_df.dtypes)

EmployeeID     int64
Name          object
Department    object
Salary         int64
dtype: object

6. Check for missing values in each column.

In [42]:
'''missing = employees_df.isnull().sum()
print(missing[missing > 0])'''

print(employees_df.isnull().sum())

EmployeeID    0
Name          0
Department    0
Salary        0
dtype: int64

7. Rename a column in the DataFrame.

In [40]:
print(location_df)
temp_location_df = location_df.rename(columns={'EmployeeID':'EmpID'})
print(temp_location_df)

   EmployeeID       Location
0           1       New York
1           2  San Francisco
2           3         Boston
3           4        Chicago
4           5    Los Angeles
5           6         Austin
6           7          Miami
7           8         Dallas
8           9        Seattle
9          10         Denver
   EmpID       Location
0      1       New York
1      2  San Francisco
2      3         Boston
3      4        Chicago
4      5    Los Angeles
5      6         Austin
6      7          Miami
7      8         Dallas
8      9        Seattle
9     10         Denver

8. Filter the DataFrame to get rows where a column value is greater than a certain number.

In [38]:
employees_df[employees_df['Salary'] > 50000]

   EmployeeID       Name   Department  Salary
0           1       John  Engineering   55000
2           3      Peter  Engineering   60000
3           4      Linda           HR   75000
5           6   Patricia  Engineering   52000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000

9. Select specific columns from the DataFrame.

In [46]:
# without header details
employees_df['Salary']

0    55000
1    46000
2    60000
3    75000
4    49000
5    52000
6    82000
7    67000
8      500
9     3000
Name: Salary, dtype: int64

In [47]:
# with header details
employees_df[['Salary']]

   Salary
0   55000
1   46000
2   60000
3   75000
4   49000
5   52000
6   82000
7   67000
8     500
9    3000

In [ ]:
'''
employees_df[employees_df['Salary'] > 40000]
employees_df[employees_df['Salary'] > 60000][['Name']]
employees_df[employees_df['Salary'] > 60000][['Name','Salary']] 
'''

10. Drop a column from the DataFrame.

In [51]:
print(employees_df)
empDrop_df = employees_df.drop('Salary', axis=1)
print(empDrop_df)

   EmployeeID       Name   Department  Salary
0           1       John  Engineering   55000
1           2       Anna    Marketing   46000
2           3      Peter  Engineering   60000
3           4      Linda           HR   75000
4           5      James    Marketing   49000
5           6   Patricia  Engineering   52000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000
8           9      David    Marketing     500
9          10      Susan           HR    3000
   EmployeeID       Name   Department
0           1       John  Engineering
1           2       Anna    Marketing
2           3      Peter  Engineering
3           4      Linda           HR
4           5      James    Marketing
5           6   Patricia  Engineering
6           7    Michael           HR
7           8  Elizabeth  Engineering
8           9      David    Marketing
9          10      Susan           HR

	Method 1: Using drop() method	
		a. Drop column - returns new data frame, exist new data frame
				df = df.drop('Salary', axis=1)
		b. Drop column - modifies existing data frame
				df.drop('Salary', axis=1, inplace=True)
	Method 2: Using del statement
		a. Removes the column in place
				del df['Salary']
	Method 3: Using pop() method
		a. Removes the column and return it as separate
				salary_column = df.pop('Salary')
	Method 4: Reassigning with column selction (excludes column)
		a. create new dataframe that excludes the column
				df = df[[col for col in df.columns if col != 'Salary']]

11. Apply a transformation to a column (e.g., multiply each value by 2)

In [ ]:
employees_df['Salary'] = employees_df['Salary'] * 2
employees_df

   EmployeeID       Name   Department  Salary
0           1       John  Engineering  110000
1           2       Anna    Marketing   92000
2           3      Peter  Engineering  120000
3           4      Linda           HR  150000
4           5      James    Marketing   98000
5           6   Patricia  Engineering  104000
6           7    Michael           HR  164000
7           8  Elizabeth  Engineering  134000
8           9      David    Marketing    1000
9          10      Susan           HR    6000

12. Add a new column based on an operation on existing columns.

In [58]:
employees_df['Annual Income'] = employees_df['Salary'] * 12
employees_df

   EmployeeID       Name   Department  Salary  Annual Income
0           1       John  Engineering   55000         660000
1           2       Anna    Marketing   46000         552000
2           3      Peter  Engineering   60000         720000
3           4      Linda           HR   75000         900000
4           5      James    Marketing   49000         588000
5           6   Patricia  Engineering   52000         624000
6           7    Michael           HR   82000         984000
7           8  Elizabeth  Engineering   67000         804000
8           9      David    Marketing     500           6000
9          10      Susan           HR    3000          36000

13. Group the data by a categorical column and get the mean of each group.

In [59]:
mean_df = employees_df.groupby('Department').mean(numeric_only=True)
mean_df

             EmployeeID        Salary  Annual Income
Department
Engineering    4.500000  58500.000000       702000.0
HR             7.000000  53333.333333       640000.0
Marketing      5.333333  31833.333333       382000.0

In [ ]:
#mean_df = employees_df.groupby('Department')['Salary'].mean()
mean_df = employees_df.groupby('Department')[['Annual Income']].mean()
mean_df

             Annual Income
Department
Engineering       702000.0
HR                640000.0
Marketing         382000.0

14. Sort the DataFrame based on a specific column.

In [63]:
df_sorted = employees_df.sort_values(by='Salary')
df_sorted

   EmployeeID       Name   Department  Salary  Annual Income
8           9      David    Marketing     500           6000
9          10      Susan           HR    3000          36000
1           2       Anna    Marketing   46000         552000
4           5      James    Marketing   49000         588000
5           6   Patricia  Engineering   52000         624000
0           1       John  Engineering   55000         660000
2           3      Peter  Engineering   60000         720000
7           8  Elizabeth  Engineering   67000         804000
3           4      Linda           HR   75000         900000
6           7    Michael           HR   82000         984000

	a. Ascending Order
		df_sorted = df.sort_values(by='Salary') 
	b. Descending order
		df_sorted = df.sort_values(by='Salary', ascending=False)
	c. Multiple Sorting
	df_multiple = df.sort_values(by=['Department', 'Salary'], ascending=[True,False])
		Department (A–Z), Salary (high to low)
	df_multiple = df.sort_values(by=['Department', 'Salary'], ascending=[True,True])
		Department (A–Z), Salary (low to high)

15. Merge two DataFrames on a common column.

In [ ]:
employee_df = pd.read_csv('../csv_files/employees.csv')
location_df = pd.read_csv('../csv_files/locations.csv')
merged_df = pd.merge(employee_df,location_df,on='EmployeeID')
merged_df

   EmployeeID       Name   Department  Salary       Location
0           1       John  Engineering   55000       New York
1           2       Anna    Marketing   46000  San Francisco
2           3      Peter  Engineering   60000         Boston
3           4      Linda           HR   75000        Chicago
4           5      James    Marketing   49000    Los Angeles
5           6   Patricia  Engineering   52000         Austin
6           7    Michael           HR   82000          Miami
7           8  Elizabeth  Engineering   67000         Dallas
8           9      David    Marketing     500        Seattle
9          10      Susan           HR    3000         Denver

	Merge:
	==> used to combine two DataFrames based on common columns or indexes
	==> powerful tool for relational data operations.
	
	pd.merge(emp_df, loc_df, on='common_column', how='join_type')

	1. Inner Join (default)
		Keeps only rows with matching values in both DataFrames.
			pd.merge(emp_df, loc_df, on='common_column', how='inner')
	2. Left Join
		Keeps all rows from the left DataFrame, and matches from the right.		
			pd.merge(emp_df, loc_df, on='common_column', how='left')
	3. Right Join
		Keeps all rows from the right DataFrame.
			pd.merge(emp_df, loc_df, on='common_column', how='right')
	4. Outer Join
		Keeps all rows from both DataFrames; fills in NaN where there's no match.
			pd.merge(emp_df, loc_df, on='common_column', how='outer')

16. Join two DataFrames using an index.

In [84]:
employee_df = pd.read_csv('../csv_files/employees.csv')
department_df = pd.read_csv('../csv_files/departments.csv')
department_df

   DepartmentID   Department        Manager
0             1  Engineering       John Doe
1             2    Marketing     Jane Smith
2             3           HR  Michael Brown

In [85]:
employee_df.set_index('Department', inplace=True)
department_df.set_index('Department', inplace=True)

In [86]:
joined_df = employee_df.join(department_df, how='inner')
joined_df

             EmployeeID       Name  Salary  DepartmentID        Manager
Department
Engineering           1       John   55000             1       John Doe
Marketing             2       Anna   46000             2     Jane Smith
Engineering           3      Peter   60000             1       John Doe
HR                    4      Linda   75000             3  Michael Brown
Marketing             5      James   49000             2     Jane Smith
Engineering           6   Patricia   52000             1       John Doe
HR                    7    Michael   82000             3  Michael Brown
Engineering           8  Elizabeth   67000             1       John Doe
Marketing             9      David     500             2     Jane Smith
HR                   10      Susan    3000             3  Michael Brown

In [ ]:
'''employee_df = pd.read_csv('../csv_files/employees.csv')
department_df = pd.read_csv('../csv_files/departments.csv')
joined_df = pd.merge(employee_df,department_df,how='inner')
joined_df'''

17. Apply a function to each element in a column using .apply()

In [93]:
employees_df['Bonus Salary'] = employees_df['Annual Income'].apply(lambda x: x + 5000)
employees_df

   EmployeeID       Name   Department  Salary  Annual Income  Bonus Salary
0           1       John  Engineering   55000         660000        665000
1           2       Anna    Marketing   46000         552000        557000
2           3      Peter  Engineering   60000         720000        725000
3           4      Linda           HR   75000         900000        905000
4           5      James    Marketing   49000         588000        593000
5           6   Patricia  Engineering   52000         624000        629000
6           7    Michael           HR   82000         984000        989000
7           8  Elizabeth  Engineering   67000         804000        809000
8           9      David    Marketing     500           6000         11000
9          10      Susan           HR    3000          36000         41000

18. Create a new DataFrame by filtering rows based on multiple conditions.

In [ ]:
#Filter: Department is "Engineering" AND Salary > 50000
filtered_df = employees_df[(employees_df['Department'] == 'Engineering') & (employees_df['Salary'] > 50000)]
filtered_df

   EmployeeID       Name   Department  Salary  Annual Income  Bonus Salary
0           1       John  Engineering   55000         660000        665000
2           3      Peter  Engineering   60000         720000        725000
5           6   Patricia  Engineering   52000         624000        629000
7           8  Elizabeth  Engineering   67000         804000        809000

19. Convert a column from string to a numeric type.

In [100]:
employees_df['Bonus Salary'] = employees_df['Bonus Salary'].astype(str)
employees_df.dtypes

EmployeeID        int64
Name             object
Department       object
Salary            int64
Annual Income     int64
Bonus Salary     object
dtype: object

In [101]:
employees_df['Bonus Salary'] = pd.to_numeric(employees_df['Bonus Salary'])
employees_df.dtypes

EmployeeID        int64
Name             object
Department       object
Salary            int64
Annual Income     int64
Bonus Salary      int64
dtype: object

20. Save the modified DataFrame to a new CSV file.

In [102]:
employees_df.to_csv('../csv_files/modified_employees.csv', index=False)

Notes:
index=False prevents pandas from writing row numbers (index) to the CSV.

Replace 'modified_employees.csv' with your desired file name or path.